import re

before_keywords = ["集采", "预灌封", "预充式", "预充装","小" ,r"\[N-R\]", r"\[N-N\]", r"\[30R\]", r"\[50R\]", r"笔芯\[Y-R\]", r"\(笔芯\)",r"\(水果味\)", r"笔芯",r"预充",r"预装式",r"预冲式",r"预填充"]
unit_keywords = ["单位", "万单位","m", "ml", "mg", "g", "IU", "WU" ,"UG", "mgI","ML","喷","微克","吸","粒","μg","揿","揿×","mg:","g:","喷\*","l"]
keyword_pattern = "|".join(before_keywords)
unit_pattern = "|".join(unit_keywords)
pattern = rf"^(.+?)\s*(?:{keyword_pattern})?\s*(((\d+(\.\d+)?)%?[a-zA-Z%μ]*\s*)+({unit_pattern})((\d+(\.\d+)?\s*)+({unit_pattern})\s*)*x?\d*\s*)/\s*(\S+)$"
# search_num_text = re.compile(r'\d')

texts = [
    "典必眼(安布素地5l/支",
    "美平(注射用美罗培南)0.5g/瓶",
    "注射用美罗培南0.5g/支",
    "泰能(注射用亚胺培南西司他丁钠) 0.5g/0.5g/支",
    "怡万之(注射用厄他培南) 1g/瓶",
    "注射用哌拉西林钠他唑巴坦钠 瀚晖4.5g/支",
    "注射用哌拉西林钠他唑巴坦钠 ▲4.5g/支",
    "一君(注射用哌拉西林钠舒巴坦钠) 2.5g/瓶",
    "注射用舒巴坦钠 0.5g/瓶",
    "可耐(膦甲酸钠氯化钠注射液) 3g250ml/瓶",
    "注射用阿莫西林钠克拉维酸钾 ▲1.2g/支",
    "泰阁(注射用替加环素) 50mg/支",
    "注射用盐酸多西环素 0.1g/瓶",
    "注射用替加环素 50mg/支",
    "稳可信(注射用盐酸万古霉素) 500mg/支",
    "注射用盐酸万古霉素 50WU/瓶",
    "希舒美注射剂(注射用阿奇霉素) 0.5g/支",
    "奥硝唑注射液 ▲0.5g3ml/支",
    "维宏（注射用阿奇霉素） 50万单位0.5g/支",
    "硫酸庆大霉素注射液 80mg2ml/支",
    "硫酸异帕米星注射液 400mg4ml/瓶",
    "硫酸阿米卡星注射液 20万单位0.2g2ml/支",
    "硫酸妥布霉素注射液 80mg2ml/支",
    "克必信(注射用达托霉素) 0.5g/瓶",
    "克林霉素磷酸酯注射液 集采0.6g4ml/支",
    "维夫欣(注射用利福平) 0.45g/支",
    "异烟肼注射液 0.1g2ml/支",
    "威凡(注射用伏立康唑) 200mg/支",
    "注射用阿昔洛韦 0.25g/支",
    "高渗枸橼酸盐嘌呤溶液 500ml/袋",
    "注射用更昔洛韦 0.25g/支",
    "注射用两性霉素B胆固醇硫酸酯复 50mg/瓶"
]

for text in texts:
    matches = re.findall(pattern, text)
    if matches: 
        answer = []
        for match in matches:
            answer.append(match[0])
            print("-----------")
        print(answer)
    else:
        print("未能匹配:", text)
