# -*- coding: utf-8 -*-
import json

class_map = {0: '未知', 1: '世可(复方电解质眼内冲洗液)', 2: '美平(注射用美罗培南)', 3: '注射用美罗培南',
             4: '泰能(注射用亚胺培南西司他丁钠)', 5: '怡万之(注射用厄他培南)', 6: '注射用哌拉西林钠他唑巴坦钠',
             7: '注射用哌拉西林钠他唑巴坦钠', 8: '一君(注射用哌拉西林钠舒巴坦钠)', 9: '注射用舒巴坦钠',
             10: '可耐(膦甲酸钠氯化钠注射液)', 11: '注射用阿莫西林钠克拉维酸钾', 12: '泰阁(注射用替加环素)',
             13: '注射用盐酸多西环素', 14: '注射用替加环素', 15: '稳可信(注射用盐酸万古霉素)', 16: '注射用盐酸万古霉素',
             17: '希舒美注射剂(注射用阿奇霉素)', 18: '奥硝唑注射液', 19: '维宏（注射用阿奇霉素）',
             20: '硫酸庆大霉素注射液', 21: '硫酸异帕米星注射液', 22: '硫酸阿米卡星注射液', 23: '硫酸妥布霉素注射液',
             24: '克必信(注射用达托霉素)', 25: '克林霉素磷酸酯注射液', 26: '维夫欣(注射用利福平)', 27: '异烟肼注射液',
             28: '威凡(注射用伏立康唑)', 29: '注射用阿昔洛韦', 30: '高渗枸橼酸盐嘌呤溶液', 31: '注射用更昔洛韦',
             32: '注射用两性霉素B胆固醇硫酸酯复', 33: '注射用伏立康唑', 34: '力纬(帕拉米韦氯化钠注射液)',
             35: '中人氟安[管装](氟尿嘧啶植入剂)', 36: '甲氨蝶呤注射液', 37: '氟尿嘧啶注射液',
             38: '法玛新(注射用盐酸表柔比星)', 39: '万珂(注射用硼替佐米)', 40: '注射用硼替佐米',
             41: '注射用盐酸吡柔比星', 42: '注射用硼替佐米', 43: '维达莎(注射用阿扎胞苷)', 44: '赛德萨(注射用阿糖胞苷)',
             45: '注射用阿扎胞苷', 46: '注射用盐酸吉西他滨', 47: '注射用盐酸吉西他滨', 48: '注射用盐酸美法仑',
             49: '注射用盐酸苯达莫司汀', 50: '注射用盐酸博来霉素',
             51: '格拉诺赛特(注射用重组人粒细胞刺激因子[CHO细胞])', 52: '山地明(环孢素注射液)',
             53: '格拉诺赛特(注射用重组人粒细胞刺激因子[CHO细胞])', 54: '达菲林(注射用醋酸曲普瑞林)',
             55: '注射用吗替麦考酚酯', 56: '诺欣(顺铂注射液)', 57: '普乐可复(他克莫司注射液)', 58: '依托泊苷注射液',
             59: '抑那通(注射用醋酸亮丙瑞林微球)', 60: '盐酸米托蒽醌氯化钠注射液', 61: '密固达(唑来膦酸注射液)',
             62: '博宁(注射用帕米膦酸二钠)', 63: '注射用唑来膦酸浓溶液', 64: '唑来瞵酸注射液',
             65: '潘妥洛克(注射用泮托拉唑钠)', 66: '壹丽安注射剂(注射用艾普拉唑钠)', 67: '注射用泮托拉唑钠',
             68: '洛赛克注射剂(注射用奥美拉唑钠)', 69: '注射用奥美拉唑钠', 70: '注射用艾司奥美拉唑钠',
             71: '特耐(注射用帕瑞昔布钠)', 72: '凯纷(氟比洛芬酯注射液)', 73: '注射用帕瑞昔布钠',
             74: '盐酸昂丹司琼注射液', 75: '赛格恩(盐酸托烷司琼注射液)', 76: '盐酸昂丹司琼注射液',
             77: '止若(盐酸帕洛诺司琼注射液)', 78: '盐酸帕洛诺司琼注射液', 79: '施沛特(玻璃酸钠注射液)',
             80: '聚多卡醇注射液', 81: '聚多卡醇注射液', 82: '阿尔治(玻璃酸钠注射液)', 83: '曲前列尼尔注射液',
             84: '速碧林(那屈肝素钙注射液)', 85: '那屈肝素钙注射液', 86: '速碧林(那屈肝素钙注射液)',
             87: '那屈肝素钙注射液', 88: '克赛(依诺肝素钠注射液)', 89: '里尔统(注射用磷酸肌酸钠)',
             90: '依诺肝素钠注射液', 91: '克赛(依诺肝素钠注射液)', 92: '依诺肝素钠注射液', 93: '安卓(磺达肝癸钠注射液)',
             94: '磺达肝癸钠注射液', 95: '盐酸替罗非班注射用浓溶液', 96: '注射用甲磺酸萘莫司他',
             97: '盐酸罗哌卡因注射液', 98: '注射用盐酸丁卡因', 99: '弥可保注射液(甲钴胺注射液)',
             100: '苏灵(注射用尖吻蝮蛇血凝酶)', 101: '维生素K1注射液', 102: '甲钴胺注射液', 103: '盐酸利多卡因注射液',
             104: '肝素钠注射液', 105: '肝素钠封管注射液', 106: '注射用卡络磺钠', 107: '氨甲环酸注射液',
             108: '酚磺乙胺注射液', 109: '维乐福(蔗糖铁注射液)', 110: '科莫非(右旋糖酐铁注射液)', 111: '蔗糖铁注射液',
             112: '注射用腺苷钴胺', 113: '聚桂醇注射液', 114: '注射用糜蛋白酶', 115: '盐酸精氨酸注射液',
             116: '50%葡萄糖注射液', 117: '维生素B6注射液', 118: '维生素B12注射液', 119: '维生素B1注射液',
             120: '碳酸氢钠注射液', 121: '安达美(多种微量元素注射液Ⅱ)', 122: '甘油磷酸钠注射液',
             123: '潘南金注射剂(门冬氨酸钾镁注射液)', 124: '水乐维他(注射用水溶性维生素)', 125: '注射用多种维生素(12)',
             126: '注射用亚叶酸钙', 127: '奥诺先(注射用右雷佐生)', 128: '美安(美司钠注射液)',
             129: '三磷酸腺苷二钠注射液', 130: '多种油脂肪乳注射液(C6-24)', 131: '小儿复方氨基酸注射液(19AA-1)',
             132: '力太(丙氨酰谷氨酰胺注射液)', 133: '丙氨酰谷氨酰胺注射液', 134: '注射用青霉素钠',
             135: '注射用头孢唑林钠', 136: '注射用氨曲南', 137: '罗氏芬(注射用头孢曲松钠)',
             138: '西力欣(注射用头孢呋辛钠)', 139: '舒普深(注射用头孢哌酮钠舒巴坦钠)', 140: '注射用头孢他啶',
             141: '恒苏(注射用盐酸头孢吡肟)', 142: '注射用头孢美唑钠', 143: '噻吗灵(注射用拉氧头孢钠)',
             144: '青霉素皮试剂', 145: '思福妥(注射用头孢他啶阿维巴坦', 146: '人血白蛋白',
             147: '力能(中/长链脂肪乳注射液[C6-24])', 148: '甲硝唑氯化钠注射液', 149: '百普力(肠内营养混悬液[SP])',
             150: '拜复乐注射剂(盐酸莫西沙星氯化钠注射液)', 151: '乐凡命(复方氨基酸注射液[18AA-Ⅱ])',
             152: '能全力(肠内营养混悬液[TPF])', 153: '碳酸氢钠注射液', 154: '丁苯酞氯化钠注射液',
             155: '可乐必妥注射剂(左氧氟沙星氯化钠注射液)', 156: '脂肪乳氨基酸(17)葡萄糖(11%)注',
             157: '羟乙基淀粉130/0.4电解质注射液', 158: '氯化钾注射液[塑料安瓿]', 159: '维生素C注射液',
             160: '氯化钠注射液[塑料安瓿]', 161: '浓氯化钠注射液', 162: '灭菌注射用水', 163: '灭菌注射用水',
             164: '注射用甲磺酸加贝酯', 165: '硫辛酸注射液', 166: '思美泰(注射用丁二磺酸腺苷蛋氨酸)',
             167: '天普洛安(注射用乌司他丁)', 168: '氨茶碱注射液', 169: '多索茶碱注射液', 170: '盐酸苯海拉明注射液',
             171: '盐酸异丙嗪注射液', 172: '沐舒坦针(盐酸氨溴索注射液)', 173: '希为纳(注射用西维来司他钠)',
             174: '盐酸氨溴索注射液', 175: '地塞米松磷酸钠注射液', 176: '地塞米松磷酸钠注射液',
             177: '盐酸右美托咪定注射液', 178: '盐酸氯丙嗪注射液', 179: '丙戊酸钠注射用浓溶液',
             180: '甲硫酸新斯的明注射液', 181: '氟哌啶醇注射液', 182: '盐酸罂粟碱注射液', 183: '间苯三酚注射液',
             184: '雅博司(门冬氨酸鸟氨酸注射液)', 185: '丙泊酚中/长链脂肪乳注射液', 186: '注射用赖氨匹林',
             187: '得普利麻(丙泊酚乳状注射液)', 188: '硫酸阿托品注射液', 189: '盐酸消旋山莨菪碱注射液',
             190: '氢溴酸东莨菪碱注射液', 191: '氯化钙注射液', 192: '注射用甲泼尼龙琥珀酸钠',
             193: '甲强龙(注射用甲泼尼龙琥珀酸钠)', 194: '甲强龙(注射用甲泼尼龙琥珀酸钠)',
             195: '绿汀诺(注射用谷胱甘肽)', 196: '葡醛酸钠注射液', 197: '盐酸甲氧氯普胺注射液',
             198: '天晴甘美(异甘草酸镁注射液)', 199: '硫酸镁注射液', 200: '葡萄糖酸钙注射液',
             201: '舒敏注射剂(盐酸曲马多注射液)', 202: '枸橼酸咖啡因注射液', 203: '苯巴比妥钠注射液',
             204: '诺扬(酒石酸布托啡诺注射液)', 205: '力月西注射剂(咪达唑仑注射液)', 206: '地西泮注射液',
             207: '得宝松(复方倍他米松注射液)', 208: '曲安奈德注射液', 209: '氢化可的松注射液',
             210: '注射用氢化可的松琥珀酸钠', 211: '注射用七叶皂苷钠', 212: '注射用丹参多酚酸盐', 213: '注射用硝普钠',
             214: '注射用血栓通[冻干]', 215: '疏血通注射液', 216: '克林澳(马来酸桂哌齐特注射液)', 217: '醒脑静注射液',
             218: '依达拉奉右莰醇注射用浓溶液', 219: '复方曲肽注射液', 220: '可达龙注射剂(盐酸胺碘酮注射液)',
             221: '新活素(注射用重组人脑利钠肽)', 222: '爱倍(硝酸异山梨酯注射液)', 223: '丽泉(托拉塞米注射液)',
             224: '呋塞米注射液', 225: '布美他尼注射液', 226: '硝酸甘油注射液', 227: '佩尔(盐酸尼卡地平注射液)',
             228: '鲁南力康(米力农注射液)', 229: '尼膜同注射剂(尼莫地平注射液)', 230: '亚宁定(盐酸乌拉地尔注射液)',
             231: '爱络(盐酸艾司洛尔注射液)', 232: '合贝爽注射剂(注射用盐酸地尔硫卓)', 233: '甲磺酸酚妥拉明注射液',
             234: '注射用吡拉西坦', 235: '盐酸普罗帕酮注射液', 236: '盐酸异丙肾上腺素注射液', 237: '去乙酰毛花苷注射液',
             238: '盐酸多巴酚丁胺注射液', 239: '重酒石酸间羟胺注射液', 240: '盐酸洛贝林注射液', 241: '尼可刹米注射液',
             242: '重酒石酸去甲肾上腺素注射液', 243: '盐酸肾上腺素注射液', 244: '盐酸多巴胺注射液',
             245: '丁丙诺啡透皮贴剂', 246: '缩宫素注射液', 247: '卡贝缩宫素注射液', 248: '注射用促皮质素',
             249: '注射用生长抑素', 250: '欧乃派克(碘海醇注射液)', 251: '优维显(碘普罗胺注射液)', 252: '碘海醇注射液',
             253: '盐酸奥布卡因凝胶', 254: '盐酸纳洛酮注射液', 255: '亚甲蓝注射液', 256: '依地酸钙钠注射液',
             257: '氟马西尼注射液', 258: '硫酸鱼精蛋白注射液', 259: '安宝注射剂(盐酸利托君注射液)',
             260: '乳酸依沙吖啶注射液', 261: '黄体酮注射液', 262: '历设得(荧光素钠注射液)', 263: '高锰酸钾外用片',
             264: '吲哚美辛栓', 265: '莎尔福(美沙拉秦栓)', 266: '百多邦(莫匹罗星软膏)', 267: '噻托溴铵粉雾剂',
             268: '噻托溴铵粉雾剂[含吸入装置]', 269: '双氯芬酸二乙胺乳胶剂', 270: '舒利迭(沙美特罗替卡松吸入粉雾剂)',
             271: '噻托溴铵吸入喷雾剂', 272: '舒利迭(沙美特罗替卡松吸入粉雾剂)',
             273: '信必可都保(布地奈德福莫特罗吸入粉雾剂[II])', 274: '艾洛松(糠酸莫米松乳膏)', 275: '复方多黏菌素B软膏',
             276: '丁克乳膏(盐酸特比萘芬乳膏)', 277: '达克宁乳膏(硝酸咪康唑乳膏)', 278: '派瑞松(曲安奈德益康唑乳膏)',
             279: '尤卓尔(丁酸氢化可的松乳膏)', 280: '环利(环吡酮胺乳膏)', 281: '达力士软膏(卡泊三醇软膏)',
             282: '开塞露', 283: '澳能(卤米松乳膏)', 284: '莎尔福(美沙拉秦灌肠液)', 285: '迪非(双氯芬酸钠滴眼液)',
             286: '迪可罗(氧氟沙星眼膏)', 287: '玻璃酸钠滴眼液', 288: '可乐必妥滴眼剂(左氧氟沙星滴眼液)',
             289: '百力特(醋酸泼尼松龙滴眼液)', 290: '普南扑灵(普拉洛芬滴眼液)', 291: '复方托吡卡胺滴眼液',
             292: '典必殊滴眼液(妥布霉素地塞米松滴眼液)', 293: '迪友(加替沙星眼用凝胶)',
             294: '真瑞(硝酸毛果芸香碱滴眼液)', 295: '托百士滴眼液(妥布霉素滴眼液)', 296: '酒石酸溴莫尼定滴眼液',
             297: '派立明(布林佐胺滴眼液)', 298: '迪善(硫酸阿托品眼用凝胶)', 299: '玻璃酸钠滴眼液',
             300: '左氧氟沙星滴眼液', 301: '托百士眼膏(妥布霉素眼膏)', 302: '美开朗(盐酸卡替洛尔滴眼液)',
             303: '典必殊眼膏(妥布霉素地塞米松眼膏)', 304: '小牛血去蛋白提取物眼用凝胶',
             305: '易贝(人表皮生长因子滴眼液)', 306: '露达舒(氯替泼诺混悬滴眼液)', 307: '内舒拿(糠酸莫米松鼻喷雾剂)',
             308: '辅舒良(丙酸氟替卡松鼻喷雾剂)', 309: '雷诺考特(布地奈德鼻喷雾剂)', 310: '丽科明(更昔洛韦眼用凝胶)',
             311: '氧氟沙星滴耳液', 312: '红霉素眼膏', 313: '含水乳膏（含水软膏）', 314: '爱全乐(吸入用异丙托溴铵溶液)',
             315: '吸入用异丙托溴铵溶液', 316: '普米克令舒(吸入用布地奈德混悬液)', 317: '吸入用布地奈德混悬液',
             318: '博利康尼(硫酸特布他林雾化吸入用溶液)', 319: '硫酸特布他林雾化吸入用溶液',
             320: '富露施(吸入用乙酰半胱氨酸溶液)', 321: '可必特(吸入用复方异丙托溴铵溶液)',
             322: '吸入用复方异丙托溴铵溶液', 323: '阿昔洛韦凝胶', 324: '复方硫酸新霉素喷剂（新咽灵)',
             325: '复方醋酸地塞米松口腔凝胶', 326: '氧化锌洗剂(白色洗剂）', 327: '利奈唑胺葡萄糖注射液',
             328: '斯沃(利奈唑胺葡萄糖注射液)', 329: '左氧氟沙星氯化钠注射液', 330: '大扶康(氟康唑氯化钠注射液)',
             331: '复方氨基酸注射液(18AA-V-SF)', 332: '醋酸氯己定溶液', 333: '佳乐施(琥珀酰明胶注射液)',
             334: '脂肪乳氨基酸(17)葡萄糖(11%)注', 335: '瑞能(肠内营养乳剂[TPF-T])', 336: '康莱特注射液',
             337: '万汶(羟乙基淀粉130/0.4氯化钠注射液)', 338: '甘油灌肠剂', 339: '瑞代(肠内营养乳剂[TPF-D])',
             340: '醋酸氯己定溶液', 341: '乐凡命(复方氨基酸注射液[18AA-Ⅱ])', 342: '甘油果糖氯化钠注射液',
             343: '力文(结构脂肪乳注射液[C6-24])', 344: '盐酸莫西沙星氯化钠注射液', 345: '中/长链脂肪乳注射液(C8-24Ve)',
             346: '倍绣胶(猪源纤维蛋白粘合剂)', 347: '凯洛斯(注射用卡非佐米）', 348: '蓉生静丙(静注人免疫球蛋白[pH4])',
             349: '依嘉(注射用盐酸依拉环素)', 350: '赫赛莱(注射用恩美曲妥珠单抗)', 351: '新可来(美泊利珠单抗注射液)',
             352: '护固莱士(外用冻干人纤维蛋白粘合剂)', 353: '誉妥(赛帕利单抗注射液)', 354: '醋酸奥曲肽注射液',
             355: '康斯平(人凝血因子Ⅷ)', 356: '康舒宁(人凝血酶原复合物)', 357: '日达仙(注射用胸腺法新)',
             358: '汉曲优(注射用曲妥珠单抗)', 359: '可瑞达(帕博利珠单抗注射液)', 360: '新德路生(人白介素-2注射液)',
             361: '瑞普佳（阿加糖酶α注射用浓溶液', 362: '优罗华(注射用维泊妥珠单抗)', 363: '醋酸兰瑞肽缓释注射液',
             364: '诺和灵R笔芯（人胰岛素注射液）', 365: '诺和灵N笔芯(精蛋白人胰岛素注射',
             366: '诺和灵30R笔芯(精蛋白人胰岛素混', 367: '瑞白(人粒细胞刺激因子注射液)', 368: '塞替派注射液',
             369: '诺和灵50R笔芯（精蛋白人胰岛素', 370: '诺和平笔芯(地特胰岛素注射液)', 371: '胰岛素注射液',
             372: '善宁(醋酸奥曲肽注射液)', 373: '来优时(甘精胰岛素注射液)', 374: '法莫替丁注射液',
             375: '凯时(前列地尔注射液)', 376: '门冬胰岛素注射液', 377: '优泌乐25(精蛋白锌重组赖脯胰岛素混合注射液)',
             378: '诺和锐30笔芯(门冬胰岛素30注射液)', 379: '维他利匹特(脂溶性维生素注射液Ⅱ)',
             380: '苏肽生(注射用鼠神经生长因子)', 381: '优泌乐50(精蛋白锌重组赖脯胰岛素混合注射液50R)',
             382: '优泌林R笔芯(人胰岛素注射液)', 383: '优泌乐(赖脯胰岛素注射液)', 384: '环孢素滴眼液',
             385: '益比奥(人促红素注射液)', 386: '欣母沛(卡前列素氨丁三醇注射液)',
             387: '优泌林70/30(精蛋白人胰岛素混合', 388: '诺和锐50笔芯(门冬胰岛素50注射液)',
             389: '诺和力(利拉鲁肽注射液)', 390: '达必妥(度普利尤单抗注射液)', 391: '适利达(拉坦前列素滴眼液)',
             392: '茁乐(注射用奥马珠单抗)', 393: '锋克松(注射用两性霉素B脂质体)', 394: '波立达(阿利西尤单抗注射液)',
             395: '注射用吲哚菁绿', 396: '安吉优(注射用维得利珠单抗)', 397: '特比澳(重组人血小板生成素注射液)',
             398: '诺维本(酒石酸长春瑞滨注射液)', 399: '即复宁(兔抗人胸腺C免疫球蛋白)', 400: '美罗华(利妥昔单抗注射液)',
             401: '培门冬酶注射液', 402: '美罗华(利妥昔单抗注射液)', 403: '艾瑞卡(注射用卡瑞利珠单抗)',
             404: '帕捷特(帕妥珠单抗注射液)', 405: '达伯舒(信迪利单抗注射液)', 406: '普罗力(地舒单抗注射液)',
             407: '百泽安(替雷利珠单抗注射液)', 408: '贝伐珠单抗注射液(安维汀）', 409: '注射用硫酸多黏菌素B',
             410: '善龙(注射用醋酸奥曲肽微球)', 411: '津优力(聚乙二醇化重组人粒细胞刺激因子注射液)',
             412: '喜达诺(乌司奴单抗注射液)', 413: '赫赛汀(注射用曲妥珠单抗)', 414: '喜达诺(乌司奴单抗注射液)',
             415: '爱必妥(西妥昔单抗注射液)', 416: '善龙(注射用醋酸奥曲肽微球)', 417: '诺其(注射用重组人凝血因子Ⅶa)',
             418: '兆珂(达雷妥尤单抗注射液)', 419: '聚乙二醇化重组人粒细胞刺激因子注射液', 420: '白舒非(白消安注射液)',
             421: '英飞凡(度伐利尤单抗注射液)', 422: '可善挺(司库奇尤单抗注射液)', 423: '安适利(注射用维布妥昔单抗)',
             424: '左西孟旦注射液', 425: '喜达诺(乌司奴单抗注射液)', 426: '修美乐(阿达木单抗注射液)',
             427: '兆珂(达雷妥尤单抗注射液)', 428: '舒莱(注射用巴利昔单抗)', 429: '雅美罗(托珠单抗注射液)',
             430: '抗人T细胞猪免疫球蛋白', 431: '吉赛欣(人粒细胞刺激因子注射液)', 432: '阿米福汀（注射用氨磷汀)',
             433: '释倍灵(普乐沙福注射液)', 434: '醋酸阿托西班注射液', 435: '抗人T细胞兔免疫球蛋白',
             436: '富马酸伊布利特注射液', 437: '倍力腾(注射用贝利尤单抗)', 438: '醋酸阿托西班注射液',
             439: '汉斯状(斯鲁利单抗注射液)', 440: '罗库溴铵注射液', 441: '运德素(人干扰素α-1b注射液)',
             442: '欣吉尔(注射用重组人白介素-2)', 443: '恩经复(注射用鼠神经生长因子)', 444: '利妥昔单抗注射液',
             445: '巨和粒(注射用人白介素-11)', 446: '利布洛泽(注射用罗特西普)', 447: '注射用尿激酶',
             448: '卡介菌纯蛋白衍生物', 449: '同奥(亚叶酸钙注射液)', 450: '特尔津(人粒细胞刺激因子注射液)',
             451: '多烯磷脂酰胆碱注射液', 452: '垂体后叶注射液', 453: '科赛斯(注射用醋酸卡泊芬净)',
             454: '瑞百安(依洛尤单抗注射液)', 455: '金尔力(鲑降钙素鼻喷雾剂)', 456: '人纤维蛋白原',
             457: '佳罗华(奥妥珠单抗注射液)', 458: '醋酸去氨加压素注射液', 459: '密盖息鼻喷剂(鲑降钙素鼻用喷雾剂)',
             460: '密盖息注射液(鲑降钙素注射液)', 461: '注射用胸腺法新', 462: '爱可松(罗库溴铵注射液)',
             463: '益比奥(人促红素注射液)', 464: '固尔苏(猪肺磷脂注射液)', 465: '泰欣生(尼妥珠单抗注射液)',
             466: '倍诺喜(盐酸奥布卡因滴眼液)', 467: '择捷美(舒格利单抗注射液)', 468: '注射用硫酸艾沙康唑',
             469: '环尔博(人促红素注射液)', 470: '健尼哌(重组抗CD25人源化单克隆', 471: '卡莫司汀注射液',
             472: '乐沙定(注射用奥沙利铂)', 473: '卡孕栓(卡前列甲酯栓)', 474: '珂立苏(牛肺表面活性剂)',
             475: '鞣酸软膏(Ⅰ)', 476: '西帕依固龈液', 477: '多瑞吉(芬太尼透皮贴剂)', 478: '盐酸布桂嗪注射液',
             479: '盐酸麻黄碱注射液', 480: '多瑞吉(芬太尼透皮贴剂)', 481: '盐酸哌替啶注射液', 482: '盐酸哌替啶注射液',
             483: '盐酸吗啡注射液', 484: '美施康定(硫酸吗啡缓释片.)', 485: '枸橼酸舒芬太尼注射液',
             486: '瑞捷(注射用盐酸瑞芬太尼)', 487: '枸橼酸芬太尼注射液', 488: '血液滤过置换基础液',
             489: '抗凝血用枸橼酸钠溶液', 490: 'Flexbnmin(人血白蛋白)'}


# 所需处理信息
# hand_state drug_label hand_label

def find_medicine_by_name(medicines, target_name):
    # 查找药品信息
    for med in medicines:
        if med.get('药品名称') == target_name:
            return med


# # 读取数据库
# file_path = 'drug-v3.json'
# with open(file_path, 'r', encoding='utf-8') as file:
#     try:
#         data = json.load(file)
#     except json.JSONDecodeError as e:
#         print("Error decoding JSON:", e)
#         exit()


def get_drug_by_index(cls, path):
    with open(path, 'r', encoding='utf-8') as file:
        data = json.load(file)
    for med in data:
        if med.get('index') == cls:
            return med
        else:
            return None


# ocr_res_txt = "res.txt"
# # 获取ocr txt结果并查找
# with open(ocr_res_txt, "r", encoding="utf-8") as file:
#     # 逐行读取文件内容
#     for line in file:
#         # 移除行末的换行符
#         line = line.strip()
#         # 按空格分割每行的内容
#         values = line.split()

#         # 获取类别和边界框信息
#         target_medicine_name = str(values[0])
#         x_center = float(values[1])
#         y_center = float(values[2])
#         width = float(values[3])
#         height = float(values[4])
#         matching_medicines = find_medicine_by_name(data, target_medicine_name)
#         if matching_medicines:
#             ocr_current_medicine = matching_medicines.get("货架号")
